const CurrencyService = () => {

  // return [
  //   [
  //     { 
  //     "r030":36,"txt":"Австралійський долар","rate":16.5217,"cc":"AUD","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":124,"txt":"Канадський долар","rate":18.4727,"cc":"CAD","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":156,"txt":"Юань Женьмiньбi","rate":3.5146,"cc":"CNY","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":191,"txt":"Куна","rate":3.5836,"cc":"HRK","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":203,"txt":"Чеська крона","rate":1.0743,"cc":"CZK","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":208,"txt":"Данська крона","rate":3.5767,"cc":"DKK","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":344,"txt":"Гонконгівський долар","rate":3.1533,"cc":"HKD","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":348,"txt":"Форинт","rate":0.078722,"cc":"HUF","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":356,"txt":"Індійська рупія","rate":0.34322,"cc":"INR","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":360,"txt":"Рупія","rate":0.0017936,"cc":"IDR","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":376,"txt":"Новий ізраїльський шекель","rate":7.1609,"cc":"ILS","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":392,"txt":"Єна","rate":0.22277,"cc":"JPY","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":398,"txt":"Теньге","rate":0.065066,"cc":"KZT","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":410,"txt":"Вона","rate":0.020774,"cc":"KRW","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":484,"txt":"Мексиканське песо","rate":1.3156,"cc":"MXN","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":498,"txt":"Молдовський лей","rate":1.3898,"cc":"MDL","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":554,"txt":"Новозеландський долар","rate":15.8787,"cc":"NZD","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":578,"txt":"Норвезька крона","rate":2.6612,"cc":"NOK","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":643,"txt":"Російський рубль","rate":0.38845,"cc":"RUB","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":682,"txt":"Саудівський рiял","rate":6.531,"cc":"SAR","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":702,"txt":"Сінгапурський долар","rate":17.6781,"cc":"SGD","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":710,"txt":"Ренд","rate":1.6567,"cc":"ZAR","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":752,"txt":"Шведська крона","rate":2.5463,"cc":"SEK","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":756,"txt":"Швейцарський франк","rate":25.1106,"cc":"CHF","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":818,"txt":"Єгипетський фунт","rate":1.5574,"cc":"EGP","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":826,"txt":"Фунт стерлінгів","rate":31.7966,"cc":"GBP","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":840,"txt":"Долар США","rate":24.4966,"cc":"USD","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":933,"txt":"Бiлоруський рубль","rate":11.1811,"cc":"BYN","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":944,"txt":"Азербайджанський манат","rate":14.425,"cc":"AZN","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":946,"txt":"Румунський лей","rate":5.6069,"cc":"RON","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":949,"txt":"Турецька ліра","rate":4.0557,"cc":"TRY","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":960,"txt":"СПЗ (спеціальні права запозичення)","rate":33.5639,"cc":"XDR","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":975,"txt":"Болгарський лев","rate":13.6639,"cc":"BGN","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":978,"txt":"Євро","rate":26.7246,"cc":"EUR","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":985,"txt":"Злотий","rate":6.2817,"cc":"PLN","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":12,"txt":"Алжирський динар","rate":0.20865,"cc":"DZD","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":50,"txt":"Така","rate":0.29481,"cc":"BDT","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":51,"txt":"Вірменський драм","rate":0.052297,"cc":"AMD","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":364,"txt":"Іранський ріал","rate":0.00059594,"cc":"IRR","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":368,"txt":"Іракський динар","rate":0.021033,"cc":"IQD","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":417,"txt":"Сом","rate":0.35833,"cc":"KGS","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":422,"txt":"Ліванський фунт","rate":0.016603,"cc":"LBP","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":434,"txt":"Лівійський динар","rate":17.8297,"cc":"LYD","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":458,"txt":"Малайзійський ринггіт","rate":6.1079,"cc":"MYR","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":504,"txt":"Марокканський дирхам","rate":2.6026,"cc":"MAD","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":608,"txt":"Філіппінське песо","rate":0.49181,"cc":"PHP","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":704,"txt":"Донг","rate":0.0010798,"cc":"VND","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":764,"txt":"Бат","rate":0.80289,"cc":"THB","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":784,"txt":"Дирхам ОАЕ","rate":6.8144,"cc":"AED","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":788,"txt":"Туніський динар","rate":8.8804,"cc":"TND","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":860,"txt":"Узбецький сум","rate":0.0026172,"cc":"UZS","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":901,"txt":"Новий тайванський долар","rate":0.82769,"cc":"TWD","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":934,"txt":"Туркменський новий манат","rate":7.1513,"cc":"TMT","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":936,"txt":"Ганське седі","rate":4.5488,"cc":"GHS","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":941,"txt":"Сербський динар","rate":0.23519,"cc":"RSD","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":972,"txt":"Сомоні","rate":2.5824,"cc":"TJS","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":981,"txt":"Ларі","rate":8.6712,"cc":"GEL","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":986,"txt":"Бразильський реал","rate":5.8635,"cc":"BRL","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":959,"txt":"Золото","rate":38355.31,"cc":"XAU","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":961,"txt":"Срiбло","rate":430.44,"cc":"XAG","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":962,"txt":"Платина","rate":23702.67,"cc":"XPT","exchangedate":"13.02.2020"
  //      }
  //     ,{ 
  //     "r030":964,"txt":"Паладiй","rate":57507.24,"cc":"XPD","exchangedate":"13.02.2020"
  //      }
  //     ],
  //     [
  //       { 
  //       "r030":36,"txt":"Австралійський долар","rate":16.7781,"cc":"AUD","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":124,"txt":"Канадський долар","rate":18.6674,"cc":"CAD","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":156,"txt":"Юань Женьмiньбi","rate":3.5575,"cc":"CNY","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":191,"txt":"Куна","rate":3.6634,"cc":"HRK","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":203,"txt":"Чеська крона","rate":1.0905,"cc":"CZK","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":208,"txt":"Данська крона","rate":3.6553,"cc":"DKK","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":344,"txt":"Гонконгівський долар","rate":3.194,"cc":"HKD","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":348,"txt":"Форинт","rate":0.08137,"cc":"HUF","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":356,"txt":"Індійська рупія","rate":0.34797,"cc":"INR","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":360,"txt":"Рупія","rate":0.001806,"cc":"IDR","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":376,"txt":"Новий ізраїльський шекель","rate":7.1943,"cc":"ILS","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":392,"txt":"Єна","rate":0.22594,"cc":"JPY","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":398,"txt":"Теньге","rate":0.065566,"cc":"KZT","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":410,"txt":"Вона","rate":0.020813,"cc":"KRW","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":484,"txt":"Мексиканське песо","rate":1.3325,"cc":"MXN","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":498,"txt":"Молдовський лей","rate":1.4233,"cc":"MDL","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":554,"txt":"Новозеландський долар","rate":16.0851,"cc":"NZD","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":578,"txt":"Норвезька крона","rate":2.6991,"cc":"NOK","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":643,"txt":"Російський рубль","rate":0.39582,"cc":"RUB","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":682,"txt":"Саудівський рiял","rate":6.6091,"cc":"SAR","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":702,"txt":"Сінгапурський долар","rate":17.9772,"cc":"SGD","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":710,"txt":"Ренд","rate":1.6854,"cc":"ZAR","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":752,"txt":"Шведська крона","rate":2.5908,"cc":"SEK","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":756,"txt":"Швейцарський франк","rate":25.4774,"cc":"CHF","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":818,"txt":"Єгипетський фунт","rate":1.5734,"cc":"EGP","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":826,"txt":"Фунт стерлінгів","rate":32.3574,"cc":"GBP","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":840,"txt":"Долар США","rate":24.7959,"cc":"USD","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":933,"txt":"Бiлоруський рубль","rate":11.5041,"cc":"BYN","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":944,"txt":"Азербайджанський манат","rate":14.603,"cc":"AZN","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":946,"txt":"Румунський лей","rate":5.7223,"cc":"RON","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":949,"txt":"Турецька ліра","rate":4.1423,"cc":"TRY","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":960,"txt":"СПЗ (спеціальні права запозичення)","rate":34.0962,"cc":"XDR","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":975,"txt":"Болгарський лев","rate":13.9656,"cc":"BGN","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":978,"txt":"Євро","rate":27.3152,"cc":"EUR","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":985,"txt":"Злотий","rate":6.4331,"cc":"PLN","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":12,"txt":"Алжирський динар","rate":0.20865,"cc":"DZD","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":50,"txt":"Така","rate":0.29481,"cc":"BDT","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":51,"txt":"Вірменський драм","rate":0.052297,"cc":"AMD","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":364,"txt":"Іранський ріал","rate":0.00059594,"cc":"IRR","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":368,"txt":"Іракський динар","rate":0.021033,"cc":"IQD","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":417,"txt":"Сом","rate":0.35833,"cc":"KGS","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":422,"txt":"Ліванський фунт","rate":0.016603,"cc":"LBP","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":434,"txt":"Лівійський динар","rate":17.8297,"cc":"LYD","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":458,"txt":"Малайзійський ринггіт","rate":6.1079,"cc":"MYR","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":504,"txt":"Марокканський дирхам","rate":2.6026,"cc":"MAD","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":608,"txt":"Філіппінське песо","rate":0.49181,"cc":"PHP","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":704,"txt":"Донг","rate":0.0010798,"cc":"VND","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":764,"txt":"Бат","rate":0.80289,"cc":"THB","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":784,"txt":"Дирхам ОАЕ","rate":6.8144,"cc":"AED","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":788,"txt":"Туніський динар","rate":8.8804,"cc":"TND","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":860,"txt":"Узбецький сум","rate":0.0026172,"cc":"UZS","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":901,"txt":"Новий тайванський долар","rate":0.82769,"cc":"TWD","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":934,"txt":"Туркменський новий манат","rate":7.1513,"cc":"TMT","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":936,"txt":"Ганське седі","rate":4.5488,"cc":"GHS","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":941,"txt":"Сербський динар","rate":0.23519,"cc":"RSD","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":972,"txt":"Сомоні","rate":2.5824,"cc":"TJS","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":981,"txt":"Ларі","rate":8.6712,"cc":"GEL","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":986,"txt":"Бразильський реал","rate":5.8635,"cc":"BRL","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":959,"txt":"Золото","rate":38492.41,"cc":"XAU","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":961,"txt":"Срiбло","rate":436.45,"cc":"XAG","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":962,"txt":"Платина","rate":24142.53,"cc":"XPT","exchangedate":"06.02.2020"
  //        }
  //       ,{ 
  //       "r030":964,"txt":"Паладiй","rate":61517.88,"cc":"XPD","exchangedate":"06.02.2020"
  //        }
  //       ],
  //       [
  //         { 
  //         "r030":36,"txt":"Австралійський долар","rate":16.4814,"cc":"AUD","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":124,"txt":"Канадський долар","rate":18.3436,"cc":"CAD","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":156,"txt":"Юань Женьмiньбi","rate":3.463,"cc":"CNY","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":191,"txt":"Куна","rate":3.5711,"cc":"HRK","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":203,"txt":"Чеська крона","rate":1.0522,"cc":"CZK","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":208,"txt":"Данська крона","rate":3.5576,"cc":"DKK","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":344,"txt":"Гонконгівський долар","rate":3.0862,"cc":"HKD","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":348,"txt":"Форинт","rate":0.07964,"cc":"HUF","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":356,"txt":"Індійська рупія","rate":0.33781,"cc":"INR","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":360,"txt":"Рупія","rate":0.0017403,"cc":"IDR","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":376,"txt":"Новий ізраїльський шекель","rate":6.9099,"cc":"ILS","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":392,"txt":"Єна","rate":0.21855,"cc":"JPY","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":398,"txt":"Теньге","rate":0.063402,"cc":"KZT","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":410,"txt":"Вона","rate":0.020637,"cc":"KRW","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":484,"txt":"Мексиканське песо","rate":1.2745,"cc":"MXN","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":498,"txt":"Молдовський лей","rate":1.389,"cc":"MDL","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":554,"txt":"Новозеландський долар","rate":15.8594,"cc":"NZD","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":578,"txt":"Норвезька крона","rate":2.6924,"cc":"NOK","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":643,"txt":"Російський рубль","rate":0.39076,"cc":"RUB","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":682,"txt":"Саудівський рiял","rate":6.388,"cc":"SAR","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":702,"txt":"Сінгапурський долар","rate":17.7565,"cc":"SGD","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":710,"txt":"Ренд","rate":1.6828,"cc":"ZAR","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":752,"txt":"Шведська крона","rate":2.5199,"cc":"SEK","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":756,"txt":"Швейцарський франк","rate":24.5596,"cc":"CHF","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":818,"txt":"Єгипетський фунт","rate":1.4987,"cc":"EGP","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":826,"txt":"Фунт стерлінгів","rate":31.3258,"cc":"GBP","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":840,"txt":"Долар США","rate":23.9677,"cc":"USD","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":933,"txt":"Бiлоруський рубль","rate":11.3162,"cc":"BYN","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":944,"txt":"Азербайджанський манат","rate":14.1136,"cc":"AZN","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":946,"txt":"Румунський лей","rate":5.5626,"cc":"RON","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":949,"txt":"Турецька ліра","rate":4.0775,"cc":"TRY","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":960,"txt":"СПЗ (спеціальні права запозичення)","rate":33.0596,"cc":"XDR","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":975,"txt":"Болгарський лев","rate":13.5941,"cc":"BGN","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":978,"txt":"Євро","rate":26.5874,"cc":"EUR","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":985,"txt":"Злотий","rate":6.2623,"cc":"PLN","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":12,"txt":"Алжирський динар","rate":0.19841,"cc":"DZD","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":50,"txt":"Така","rate":0.27899,"cc":"BDT","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":51,"txt":"Вірменський драм","rate":0.049398,"cc":"AMD","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":364,"txt":"Іранський ріал","rate":0.00056396,"cc":"IRR","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":368,"txt":"Іракський динар","rate":0.019904,"cc":"IQD","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":417,"txt":"Сом","rate":0.33985,"cc":"KGS","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":422,"txt":"Ліванський фунт","rate":0.015712,"cc":"LBP","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":434,"txt":"Лівійський динар","rate":16.8777,"cc":"LYD","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":458,"txt":"Малайзійський ринггіт","rate":5.7368,"cc":"MYR","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":504,"txt":"Марокканський дирхам","rate":2.4677,"cc":"MAD","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":608,"txt":"Філіппінське песо","rate":0.46721,"cc":"PHP","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":704,"txt":"Донг","rate":0.0010221,"cc":"VND","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":764,"txt":"Бат","rate":0.78556,"cc":"THB","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":784,"txt":"Дирхам ОАЕ","rate":6.4489,"cc":"AED","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":788,"txt":"Туніський динар","rate":8.3827,"cc":"TND","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":860,"txt":"Узбецький сум","rate":0.002489,"cc":"UZS","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":901,"txt":"Новий тайванський долар","rate":0.78645,"cc":"TWD","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":934,"txt":"Туркменський новий  манат","rate":6.7675,"cc":"TMT","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":936,"txt":"Ганське седі","rate":4.1193,"cc":"GHS","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":941,"txt":"Сербський динар","rate":0.22477,"cc":"RSD","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":972,"txt":"Сомоні","rate":2.443,"cc":"TJS","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":981,"txt":"Ларі","rate":8.2747,"cc":"GEL","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":986,"txt":"Бразильський реал","rate":5.8477,"cc":"BRL","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":959,"txt":"Золото","rate":37116.14,"cc":"XAU","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":961,"txt":"Срiбло","rate":428.67,"cc":"XAG","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":962,"txt":"Платина","rate":23275.27,"cc":"XPT","exchangedate":"13.01.2020"
  //          }
  //         ,{ 
  //         "r030":964,"txt":"Паладiй","rate":50890.62,"cc":"XPD","exchangedate":"13.01.2020"
  //          }
  //         ],
  //         [
  //           { 
  //           "r030":36,"txt":"Австралійський долар","rate":19.155887,"cc":"AUD","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":124,"txt":"Канадський долар","rate":20.380563,"cc":"CAD","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":156,"txt":"Юань Женьмiньбi","rate":3.989129,"cc":"CNY","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":191,"txt":"Куна","rate":4.118205,"cc":"HRK","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":203,"txt":"Чеська крона","rate":1.179222,"cc":"CZK","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":208,"txt":"Данська крона","rate":4.088239,"cc":"DKK","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":344,"txt":"Гонконгівський долар","rate":3.441128,"cc":"HKD","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":348,"txt":"Форинт","rate":0.0959995,"cc":"HUF","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":356,"txt":"Індійська рупія","rate":0.3822968,"cc":"INR","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":360,"txt":"Рупія","rate":0.00191971,"cc":"IDR","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":364,"txt":"Іранський ріал","rate":0.000643,"cc":"IRR","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":376,"txt":"Новий ізраїльський шекель","rate":7.420623,"cc":"ILS","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":392,"txt":"Єна","rate":0.2446485,"cc":"JPY","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":398,"txt":"Теньге","rate":0.072056,"cc":"KZT","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":410,"txt":"Вона","rate":0.0240364,"cc":"KRW","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":484,"txt":"Мексіканський песо","rate":1.403335,"cc":"MXN","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":498,"txt":"Молдовський лей","rate":1.577135,"cc":"MDL","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":554,"txt":"Новозеландський долар","rate":18.195065,"cc":"NZD","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":578,"txt":"Норвезька крона","rate":3.114616,"cc":"NOK","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":643,"txt":"Російський рубль","rate":0.41098,"cc":"RUB","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":682,"txt":"Саудівський рiял","rate":7.201998,"cc":"SAR","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":702,"txt":"Сінгапурський долар","rate":19.895438,"cc":"SGD","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":710,"txt":"Ренд","rate":1.961643,"cc":"ZAR","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":752,"txt":"Шведська крона","rate":2.913122,"cc":"SEK","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":756,"txt":"Швейцарський франк","rate":26.805786,"cc":"CHF","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":818,"txt":"Єгипетський фунт","rate":1.53895,"cc":"EGP","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":826,"txt":"Фунт стерлінгів","rate":34.784408,"cc":"GBP","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":840,"txt":"Долар США","rate":27.007494,"cc":"USD","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":933,"txt":"Бiлоруський рубль","rate":12.51448,"cc":"BYN","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":944,"txt":"Азербайджанський манат","rate":15.886761,"cc":"AZN","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":946,"txt":"Румунський лей","rate":6.434316,"cc":"RON","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":949,"txt":"Турецька ліра","rate":5.138999,"cc":"TRY","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":960,"txt":"СПЗ(спеціальні права запозичення)","rate":37.459214,"cc":"XDR","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":975,"txt":"Болгарський лев","rate":15.598561,"cc":"BGN","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":978,"txt":"Євро","rate":30.507665,"cc":"EUR","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":985,"txt":"Злотий","rate":7.052328,"cc":"PLN","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":12,"txt":"Алжирський динар","rate":0.234946,"cc":"DZD","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":50,"txt":"Така","rate":0.331909,"cc":"BDT","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":51,"txt":"Вiрменський драм","rate":0.0569653,"cc":"AMD","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":368,"txt":"Іракський динар","rate":0.023382,"cc":"IQD","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":417,"txt":"Сом","rate":0.397276,"cc":"KGS","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":422,"txt":"Ліванський фунт","rate":0.018424,"cc":"LBP","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":434,"txt":"Лівійський динар","rate":20.1211,"cc":"LYD","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":458,"txt":"Малайзійський ринггіт","rate":6.782331,"cc":"MYR","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":504,"txt":"Марокканський дирхам","rate":2.920716,"cc":"MAD","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":586,"txt":"Пакистанська рупія","rate":0.200339,"cc":"PKR","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":704,"txt":"Донг","rate":0.00119558,"cc":"VND","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":764,"txt":"Бат","rate":0.888131,"cc":"THB","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":784,"txt":"Дирхам ОАЕ","rate":7.553082,"cc":"AED","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":788,"txt":"Туніський динар","rate":9.198541,"cc":"TND","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":860,"txt":"Узбецький сум","rate":0.003308,"cc":"UZS","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":901,"txt":"Новий тайванський долар","rate":0.903261,"cc":"TWD","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":934,"txt":"Туркменський новий манат","rate":7.925989,"cc":"TMT","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":936,"txt":"Ганських седі","rate":5.633025,"cc":"GHS","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":941,"txt":"Сербський динар","rate":0.269565,"cc":"RSD","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":972,"txt":"Сомонi","rate":2.939159,"cc":"TJS","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":981,"txt":"Ларi","rate":10.449753,"cc":"GEL","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":959,"txt":"Золото","rate":35423.029,"cc":"XAU","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":961,"txt":"Срiбло","rate":424.153,"cc":"XAG","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":962,"txt":"Платина","rate":21362.928,"cc":"XPT","exchangedate":"13.02.2019"
  //            }
  //           ,{ 
  //           "r030":964,"txt":"Паладiй","rate":37486.402,"cc":"XPD","exchangedate":"13.02.2019"
  //            }
  //           ]



  // ]
  
  return Promise.all([
    fetch('https://bank.gov.ua/NBUStatService/v1/statdirectory/exchange?date=20200213&json'),
    fetch('https://bank.gov.ua/NBUStatService/v1/statdirectory/exchange?date=20200206&json'),
    fetch('https://bank.gov.ua/NBUStatService/v1/statdirectory/exchange?date=20200113&json'),
    fetch('https://bank.gov.ua/NBUStatService/v1/statdirectory/exchange?date=20190213&json')
  ]).then( (result) => {
    return Promise.all((result.map(v => v.json())))
  }) 
  .catch((err) => {
    console.log(err);
  });

  
    
};

export default CurrencyService;